// 输入阶数，生成n阶魔方
// 每行和、每列和、对角线和都为一常数即为魔方
// 生成规则：
// 1、把1放在第一行中间
// 2、每一放置数字，位置都是行一个数字的紧邻右上方（行减一，列加一）
// 3、若上一个数字在右上角，则这次的数字放在上一个数字的下面
// 4、若上一个数字在第一行，则这次的数字放最后行
// 5、若上一个数字在最后列，则这次的数字放第一列
// 6、若目标位置以被占，则这次的数字放上一个数字的下面
#include <stdio.h>
#include <windows.h>
int main()
{
    int i, j, k, n, a[20][20]={0};
    printf("输入奇阶数：");
    do {
        scanf("%d", &n);
    } while (!(n%2!=0 && n>=0 && n<=20));   // 检查n的输入
    a[0][(n-1)/2] = 1;  // 规则1
    i = 0, j = (n-1) / 2;   // 开始位置
    for (k = 2; k <= n*n; k++)
    {
        i -= 1, j += 1;     // 规则2
        if (i < 0 && j > n-1)   // 规则3
            i += 2, j -= 1;
        else if (i < 0) // 规则4
            i = n-1;
        else if (j > n-1)  // 规则5
            j = 0;
        if (a[i][j] != 0)   // 规则6
            i += 2, j -= 1;
        a[i][j] = k;
    }
    for (i = 0; i < n; i++)
    {
        for (j = 0; j < n; j++)
            printf("%3d", a[i][j]);
        printf("\n");
    }
    system("pause");
    return 0;
}